# Starting off

### For last week's lab?
- How did you store your data after scraping or pulling from the API?
- Did you run into any issuesstoring your data this way?
- What would you do if you need to update the saved data or add additional data points?

# A BEGINNER’S GUIDE TO DATABASES & SQL

**Objective:** SWBAT create a SQLite db instance, create tables and insert records into those tables

**Agenda:**
- Overview of databases
- Discuss Differences between SQL DBs
- Explain the basic structures of a RDBMS
- Instantiate SQLite DB instance on your computer

### What is a Database?
- In general, databases store sets of data that can be queried for use in other applications. A database management system supports the development, administration and use of database platforms.


### What is a Relational Database? 
- A *relational database management system* (**RDBMS**) is a type of DBMS with a row-based table structure that connects related data elements and includes functions that maintain the security, accuracy, integrity and consistency of the data.
- The most basic **RDBMS** functions are related to *create, read, update and delete* operations, collectively known as **CRUD**.

### What is SQL?

- **SQL** (usually pronounced like the word “sequel”) stands for Structured Query Language.
- A programming language used to communicate with data stored in a relational database management system.
- SQL syntax is similar to the English language, which makes it relatively easy to write, read, and interpret.

## POPULAR RDBMS

- SQLite
- MySQL
- PostgreSql
- Oracle DB
- SQL Server

### SQLite

- SQLite is a popular open source SQL database. 
- It can store an entire database in a single file.
- It is 'lite' because it is not server based.
- Does not have many features of server-based RDBMS like users and permissions.
- Great to get up and running quick, not good for complex projects.

### MySQL

- MySQL is the most popular open source SQL database. 
- It is typically used for web application development, and often accessed using PHP. 
- It is easy to use, inexpensive, reliable and has a large community of developers who can help answer questions.
- Open source development has lagged since Oracle has taken control of MySQL.
- Has been known to suffer from poor performance when scaling, 
- Does not include some advanced features that developers may be used to.

### PostgreSQL

- PostgreSQL is an open-source SQL database that is not controlled by any corporation.
- PostgreSQL shares many of the same advantages of MySQL.
- It is slower in performance than other databases such as MySQL
- Harder to come by hosts or service providers that offer managed PostgreSQL instances.

### Oracle DB

- Owned by Oracle Corporation, and the code is not open sourced. 
- Oracle DB is for large applications, particularly in the banking industry. 
- The main disadvantage of using Oracle is that it is not free.

### SQL Server

- Microsoft owns SQL Server. 
- Large enterprise applications mostly use SQL Server.
- Microsoft offers a free entry-level version called Express but can become very expensive as you scale your application.

### What are the major parts of a SQL DB?

- Schema
- Tables
- Indexes
- Views
- Store Procedures
- Triggers

#### Schema
A relational database schema helps you to organize and understand the structure of a database.

![alt text](employees-schema.png)

### Entity-Relationship Model

Entity-Relationship (ER) Model is based on the notion of real-world entities and relationships among them. While formulating real-world scenario into the database model, the ER Model creates entity set, relationship set, general attributes and constraints.

<img src="er_model_intro.png" >

**Entity** − An entity in an ER Model is a real-world entity having properties called attributes. Every attribute is defined by its set of values called domain. For example, in a school database, a student is considered as an entity, with various attributes like name, age, class, etc.

**Relationship** − The logical association among entities is called relationship. Relationships are mapped with entities in various ways. 

**Relationship Mappings** −

- one to one
- one to many
- many to one
- many to many

#### Tables
Tables are used to store data within the database.  They are its main component and without them, the database would serve little purpose.

- Tables can have hundreds, thousands, sometimes even millions of rows of data. These rows are often called **records**.
- The consists of **columns** of data that are labeled with a descriptive name (say, age for example) and have a specific data type.

### Indexes
Indexes are used to make data retrieval faster. Rather than having to scan an entire table for data, an index allows the database to, directly retrieve the data being asked of it.

Indexes are primariy created using using a **Primary Key**.
A primary key’s main features are:

- It must contain a unique value for each row of data.
- It cannot contain null values.

A primary key is either an existing table column or a column that is specifically generated by the database according to a defined sequence.

If you were a tax accountant and you wanted to create a database of your clients, which of the following columns who be a good choice for your primary key?

- First Name
- Last Name
- Email Address
- SSN
- Phone Number

### Views 

Help combat this issue by allowing the database administrator to create “canned” or pre-built queries.

Allow you to pull data from multiple tables together without moving or copying the data.

### Stored Procedures

There are many situations where queries alone are insufficient to solve a problem.  In these cases, developers rely on programming languages to process logic, to loop through records, and perform conditional comparisons as required.  These programs can be stored in the SQL database as stored procedures.

### Triggers

Triggers are special instructions that are executed when important events, such as inserting or updating records in a table happen. The most common triggers are Insert, Update, and Delete triggers.  

Two items define a trigger on a table: a stored procedure and an event, such as inserting a record that invokes its execution.

## Working With SQLite

SQLite comes standard with Python so all you need to do to get it set up is write:

`import sqlite3`

There are specific python modules that you can use to work with SQL dbs depending on the DB.

- Microsoft SQL = pymssql
- Postgres = psycopg2
- MySQLdb = MySQLDB

### Creating a Connection

Before you can do anything with your DB, you must first create a connection with it. For DBs that are server based, this can be more coplicated requiring you to know the server ip, a username, password database name, and port. 
``` python 
import MySQLdb
conn = MySQLdb.connect(host=host, user=user, passwd=passwd, db=db)
```

For SQLite, this is much easier because you just need to access the flat file where the DB is stored.

In [1]:
import sqlite3

conn = sqlite3.connect('tutorial.db')

#### Cursor
This temporary work area is used to store the data retrieved from the database, and manipulate this data. 

A cursor can hold more than one row, but can process only one row at a time. 

The set of rows the cursor holds is called the active set.

In [2]:
c = conn.cursor()

#### Create a Table
Now that we have a connection and a cursor, lets create a table.

#### SQLite Data Types

Any column declared in an SQLite database is assigned a type affinity depending on it declared data type. Here the list of type affinities in SQLite:

- TEXT
- NUMERIC
- INTEGER
- REAL
- BLOB

However, you still can store any type of data as you wish, these types are recommended not required.

These types were introduced in SQLite to maximize the compatibility between SQLite and other database management system.

<img src="SQLlite_datatype.jpg" width=450/>

In [5]:
create_query = """CREATE TABLE IF NOT EXISTS stuffToPlot
        (unix REAL, datestamp TEXT, keyword TEXT, value REAL)"""
def create_table(query):
    c.execute(query)

In [6]:
insert_query = """INSERT INTO stuffToPlot VALUES
                (1452549219,'2016-01-11 13:53:39','Python',6)"""
def data_entry(query):
    c.execute(query)

    conn.commit()
    
def close_c_conn():
    c.close()
    conn.close()

In [7]:
create_table(create_query)
data_entry(insert_query)

close_c_conn()

#### Inserting Data dynamically

In [14]:
import time
import datetime
import random
import pandas as pd

In [9]:
conn = sqlite3.connect('tutorial.db')
c = conn.cursor()

In [17]:
def dynamic_data_entry():

    unix = int(time.time())
    date = str(datetime.datetime.fromtimestamp(unix).strftime('%Y-%m-%d %H:%M:%S'))
    keyword = 'Python'
    value = random.randrange(0,10)
  
    c.execute("INSERT INTO stuffToPlot (unix, datestamp, keyword, value) VALUES (?, ?, ?, ?)",
          (unix, date, keyword, value))

    conn.commit()

In [18]:
for i in range(10):
    dynamic_data_entry()
    time.sleep(1)

# c.close
# conn.close()

We can also write a query that reads from the DB

In [24]:
def read_from_db():
    c.execute('SELECT * FROM stuffToPlot')
    data = c.fetchall()
#     print(data)
    for row in data:
        print(row)

read_from_db()

(1452549219.0, '2016-01-11 13:53:39', 'Python', 6.0)
(1553539359.0, '2019-03-25 14:42:39', 'Python', 7.0)
(1553539391.0, '2019-03-25 14:43:11', 'Python', 1.0)
(1553539526.0, '2019-03-25 14:45:26', 'Python', 1.0)
(1553539527.0, '2019-03-25 14:45:27', 'Python', 1.0)
(1553539528.0, '2019-03-25 14:45:28', 'Python', 3.0)
(1553539529.0, '2019-03-25 14:45:29', 'Python', 8.0)
(1553539530.0, '2019-03-25 14:45:30', 'Python', 9.0)
(1553539531.0, '2019-03-25 14:45:31', 'Python', 0.0)
(1553539532.0, '2019-03-25 14:45:32', 'Python', 5.0)
(1553539533.0, '2019-03-25 14:45:33', 'Python', 6.0)
(1553539534.0, '2019-03-25 14:45:34', 'Python', 6.0)
(1553539535.0, '2019-03-25 14:45:35', 'Python', 7.0)

We can also read a table straight into a pandas DF.

In [25]:
import pandas as pd
pd.read_sql_query("select * from stuffToPlot;", conn)

            unix            datestamp keyword  value
0   1.452549e+09  2016-01-11 13:53:39  Python    6.0
1   1.553539e+09  2019-03-25 14:42:39  Python    7.0
2   1.553539e+09  2019-03-25 14:43:11  Python    1.0
3   1.553540e+09  2019-03-25 14:45:26  Python    1.0
4   1.553540e+09  2019-03-25 14:45:27  Python    1.0
5   1.553540e+09  2019-03-25 14:45:28  Python    3.0
6   1.553540e+09  2019-03-25 14:45:29  Python    8.0
7   1.553540e+09  2019-03-25 14:45:30  Python    9.0
8   1.553540e+09  2019-03-25 14:45:31  Python    0.0
9   1.553540e+09  2019-03-25 14:45:32  Python    5.0
10  1.553540e+09  2019-03-25 14:45:33  Python    6.0
11  1.553540e+09  2019-03-25 14:45:34  Python    6.0
12  1.553540e+09  2019-03-25 14:45:35  Python    7.0

And we can create a DB table directly from a pandas DF.

In [26]:
cities = pd.read_csv('cities.csv')
cities.head()

,LatD,"""LatM""","""LatS""","""NS""","""LonD""","""LonM""","""LonS""","""EW""","""City""","""State"""
0,41,5,59,"""N""",80,39,0,"""W""","""Youngstown""",OH
1,42,52,48,"""N""",97,23,23,"""W""","""Yankton""",SD
2,46,35,59,"""N""",120,30,36,"""W""","""Yakima""",WA
3,42,16,12,"""N""",71,48,0,"""W""","""Worcester""",MA
4,43,37,48,"""N""",89,46,11,"""W""","""Wisconsin Dells""",WI

In [27]:
cities.to_sql("cities", conn, if_exists="replace")

C:\Users\dlm66\Anaconda3\lib\site-packages\pandas\core\generic.py:2532: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype, method=method)

In [28]:
def read_from_db():
    c.execute('SELECT * FROM cities LIMIT 10')
    data = c.fetchall()
    print(data)
    for row in data:
        print(row)

read_from_db()

[(0, 41, 5, 59, ' "N"', 80, 39, 0, ' "W"', ' "Youngstown"', ' OH'), (1, 42, 52, 48, ' "N"', 97, 23, 23, ' "W"', ' "Yankton"', ' SD'), (2, 46, 35, 59, ' "N"', 120, 30, 36, ' "W"', ' "Yakima"', ' WA'), (3, 42, 16, 12, ' "N"', 71, 48, 0, ' "W"', ' "Worcester"', ' MA'), (4, 43, 37, 48, ' "N"', 89, 46, 11, ' "W"', ' "Wisconsin Dells"', ' WI'), (5, 36, 5, 59, ' "N"', 80, 15, 0, ' "W"', ' "Winston-Salem"', ' NC'), (6, 49, 52, 48, ' "N"', 97, 9, 0, ' "W"', ' "Winnipeg"', ' MB'), (7, 39, 11, 23, ' "N"', 78, 9, 36, ' "W"', ' "Winchester"', ' VA'), (8, 34, 14, 24, ' "N"', 77, 55, 11, ' "W"', ' "Wilmington"', ' NC'), (9, 39, 45, 0, ' "N"', 75, 33, 0, ' "W"', ' "Wilmington"', ' DE')]
(0, 41, 5, 59, ' "N"', 80, 39, 0, ' "W"', ' "Youngstown"', ' OH')
(1, 42, 52, 48, ' "N"', 97, 23, 23, ' "W"', ' "Yankton"', ' SD')
(2, 46, 35, 59, ' "N"', 120, 30, 36, ' "W"', ' "Yakima"', ' WA')
(3, 42, 16, 12, ' "N"', 71, 48, 0, ' "W"', ' "Worcester"', ' MA')
(4, 43, 37, 48, ' "N"', 89, 46, 11, ' "W"', ' "Wisconsin Dells"', ' WI')
(5, 36, 5, 59, ' "N"', 80, 15, 0, ' "W"', ' "Winston-Salem"', ' NC')
(6, 49, 52, 48, ' "N"', 97, 9, 0, ' "W"', ' "Winnipeg"', ' MB')
(7, 39, 11, 23, ' "N"', 78, 9, 36, ' "W"', ' "Winchester"', ' VA')
(8, 34, 14, 24, ' "N"', 77, 55, 11, ' "W"', ' "Wilmington"', ' NC')
(9, 39, 45, 0, ' "N"', 75, 33, 0, ' "W"', ' "Wilmington"', ' DE')

### Your Turn

In the zip folder you have a json file with informationa bout all of the students in this class.  
- Read in the JSON file
- Examine data in file
- Create a table for the data
- Create a function to insert each data entry dynamically
- Insert Data
- Write queries to answer the following questions

In [66]:
import json
f = open('students.json')
data = json.load(f)
type(data)
len(data)

22

In [67]:
import sqlite3
conn = sqlite3.connect('students.db')
c = conn.cursor()
for i in range(len((data))):
    c.execute('CREATE TABLE Students (id INTEGER PRIMARY KEY, name TEXT, birthdate NUMERIC, siblings INTEGER, Birthplace TEXT, yearsinnyc REAL, favoritefood TEXT)', (data[i]))

OperationalError: table Students already exists

In [50]:
def data_entry():
    c.execute('''CREATE TABLE Students (id INTEGER PRIMARY KEY, name TEXT, birthdate NUMERIC, siblings INTEGER, Birthplace TEXT, yearsinnyc REAL, favoritefood TEXT)''')

OperationalError: table Students already exists

In [77]:
def data_entry():
    c.execute('''INSERT INTO Students (name, birthdate, siblings, Birthplace, yearsinnyc, favoritefood) VALUES (?, ?, ?, ?, ?, ?)''', (name, birthdate, siblings, Birthplace, yearsinnyc, favoritefood))

for i in range(len(data)):
    name = data[i]['name']
    birthdate = data[i]['birthdate']
    siblings = data[i]['siblings']
    Birthplace = data[i]['Birthplace']
    yearsinnyc = data[i]['yearsinnyc']
    favoritefood = data[i]['favoritefood']
    data_entry()
    conn.commit()

In [79]:
c.execute('''select * from Students''').fetchall()

[(1, 'Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.6, 'guacamole'),
 (2, 'David Miller', '06/06', 2, 'New York, NY', 25.75, 'pizza'),
 (3, 'Abhijeet Kamble', '05/07', 0, 'Wardha, India', 0.5, 'Biriyani'),
 (4,
  'Samantha Jackson',
  '08/04',
  2,
  'Newport, RI',
  12.5,
  'chocolate chip cookies'),
 (5, 'Anmol Srivats', '11/19', 0, 'Bangalore, India', 0.05, 'Sushi'),
 (6, 'Ran Tokman', '03/19', 2, 'Haifa, Israel', 8.0, 'cheesecake'),
 (7, 'Amy Li', '12/29', 1, 'New York, NY', 18.0, 'dumplings'),
 (8, 'Florencia Leoni', '06/07', 4, 'Caracas, Venezuela', 1.2, 'steak'),
 (9, 'Austin Krause', '10/22', 1, 'Lansing, MI', 0.17, 'Everything Bagels'),
 (10, 'Natalie Overchuk', '01/02', 2, 'Kiev, Ukraine', 0.1, 'pasta'),
 (11, 'Akshay Sharma', '04/30', 2, 'New York, NY', 24.0, 'pizza'),
 (12, 'Mohamad Eldebek', '01/21', 4, 'Beirut, Leb', 17.0, 'Tabouleh'),
 (13, 'Adam Dick', '05/06', 0, 'New York, NY', 30.0, 'noodles'),
 (14, 'Menachi Korn', '04/11', 4, 'Denville, N.J.', 18.0, 'falafel'),
 (15, 'Miguel PeÃ±a', '08/14', 4, 'Lima, Peru', 8.0, 'rice'),
 (16, 'Atiar Rahman', '02/21', 2, 'Bangladesh', 22.0, 'Reeses Puffs'),
 (17, 'Fhel Dimaano', '08/20', 1, 'Manila, Philippines', 30.0, 'Kare Kare'),
 (18, 'Maks Pazuniak', '12/19', 2, 'Wilmington, DE', 15.0, 'pho'),
 (19, 'Alex Mitrani', '12/06', 1, 'New York, NY', 28.0, 'Fusilli Sorrentina'),
 (20, 'Yish Lim', '11/21', 2, 'Singapore', 5.0, 'burgers'),
 (21, 'Nicole Roach', '06/16', 1, 'Brooklyn, NY', 18.0, 'steak'),
 (22, 'Omer Hakim', '04/30', 3, 'Haifa, Israel', 3.5, 'Avocado'),
 (23, 'Omer Hakim', '04/30', 3, 'Haifa, Israel', 3.5, 'Avocado'),
 (24, 'Sean Abu Wilson', '02/06', 2, 'Birmingham, AL', 7.6, 'guacamole'),
 (25, 'David Miller', '06/06', 2, 'New York, NY', 25.75, 'pizza'),
 (26, 'Abhijeet Kamble', '05/07', 0, 'Wardha, India', 0.5, 'Biriyani'),
 (27,
  'Samantha Jackson',
  '08/04',
  2,
  'Newport, RI',
  12.5,
  'chocolate chip cookies'),
 (28, 'Anmol Srivats', '11/19', 0, 'Bangalore, India', 0.05, 'Sushi'),
 (29, 'Ran Tokman', '03/19', 2, 'Haifa, Israel', 8.0, 'cheesecake'),
 (30, 'Amy Li', '12/29', 1, 'New York, NY', 18.0, 'dumplings'),
 (31, 'Florencia Leoni', '06/07', 4, 'Caracas, Venezuela', 1.2, 'steak'),
 (32, 'Austin Krause', '10/22', 1, 'Lansing, MI', 0.17, 'Everything Bagels'),
 (33, 'Natalie Overchuk', '01/02', 2, 'Kiev, Ukraine', 0.1, 'pasta'),
 (34, 'Akshay Sharma', '04/30', 2, 'New York, NY', 24.0, 'pizza'),
 (35, 'Mohamad Eldebek', '01/21', 4, 'Beirut, Leb', 17.0, 'Tabouleh'),
 (36, 'Adam Dick', '05/06', 0, 'New York, NY', 30.0, 'noodles'),
 (37, 'Menachi Korn', '04/11', 4, 'Denville, N.J.', 18.0, 'falafel'),
 (38, 'Miguel PeÃ±a', '08/14', 4, 'Lima, Peru', 8.0, 'rice'),
 (39, 'Atiar Rahman', '02/21', 2, 'Bangladesh', 22.0, 'Reeses Puffs'),
 (40, 'Fhel Dimaano', '08/20', 1, 'Manila, Philippines', 30.0, 'Kare Kare'),
 (41, 'Maks Pazuniak', '12/19', 2, 'Wilmington, DE', 15.0, 'pho'),
 (42, 'Alex Mitrani', '12/06', 1, 'New York, NY', 28.0, 'Fusilli Sorrentina'),
 (43, 'Yish Lim', '11/21', 2, 'Singapore', 5.0, 'burgers'),
 (44, 'Nicole Roach', '06/16', 1, 'Brooklyn, NY', 18.0, 'steak'),
 (45, 'Omer Hakim', '04/30', 3, 'Haifa, Israel', 3.5, 'Avocado')]

### Questions
1. Which student was born closest to the cohort's graduation date?
2. Which student has the most siblings?
3. How many students are only children?
4. Which 3 students have lived in NYC the shortest amount of time?
5. How many students are native New Yorkers?
5. Do any two students have the same favorite food?

In [120]:
# question 1
c.execute('''select distinct name, birthdate from Students where birthdate = abs(06/21 - birthdate) order by birthdate limit 1''').fetchall()

[]

In [95]:
#question 2
c.execute('''select distinct name, siblings from Students where siblings = (select max(siblings) from Students)''').fetchall()

[('Florencia Leoni', 4),
 ('Mohamad Eldebek', 4),
 ('Menachi Korn', 4),
 ('Miguel PeÃ±a', 4)]

In [96]:
#question 3
c.execute('''select distinct name, siblings from Students where siblings=(select min(siblings) from Students)''').fetchall()

[('Abhijeet Kamble', 0), ('Anmol Srivats', 0), ('Adam Dick', 0)]

In [110]:
# question 4
c.execute('''select distinct name, yearsinnyc from Students order by yearsinnyc asc limit 3''').fetchall()

[('Anmol Srivats', 0.05), ('Natalie Overchuk', 0.1), ('Austin Krause', 0.17)]

In [103]:
#question 5
c.execute('''select distinct name, Birthplace from Students where Birthplace like '%NY' ''').fetchall()

[('David Miller', 'New York, NY'),
 ('Amy Li', 'New York, NY'),
 ('Akshay Sharma', 'New York, NY'),
 ('Adam Dick', 'New York, NY'),
 ('Alex Mitrani', 'New York, NY'),
 ('Nicole Roach', 'Brooklyn, NY')]

In [133]:
#question 6
c.execute('''select distinct count(favoritefood) from Students''').fetchall()

[(45,)]